src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПриобретения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Местоположение</name>
    <type>
      <types>EnumRef.Местоположения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриблизительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРазмещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыделитьЦветом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборкаЕстьСвободные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборкаКомпонент</name>
    <comment>это компонент компьютерной сборки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>QR_Code</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтикеткаРаспечатана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ОстаткиПоРазмещению/ОстаткиПоРазмещению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиПоРазмещению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПриблизительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размещение</name>
    <type>
      <types>CatalogRef.Размещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/НоменклатураПрисоединенныеФайлы/НоменклатураПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураПрисоединенныеФайлы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <comment>Отпечаток сертификата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/РазмещенияПрисоединенныеФайлы/РазмещенияПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазмещенияПрисоединенныеФайлы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.Размещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <comment>Отпечаток сертификата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Размещения/Размещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Размещения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыделитьЦветом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Номенклатура/Forms/Корзина/Module.bsl
#Область СобытияФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТекущийУзел	= Параметры.ТекущийУзел;
	
	ЗаполнитьДеревоТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

	ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

	Если ИДСтроки <> Неопределено Тогда
		Элементы.Товары.Развернуть(ИДСтроки);
	КонецЕсли;

	НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);

КонецПроцедуры

&НаКлиенте
Функция ОбойтиУровеньДерева(ЭлементыДерева, п_ТекущийУзел)
	
    Для Каждого СтрокаДерева Из ЭлементыДерева Цикл 
		
    	ПодСтроки = СтрокаДерева.ПолучитьЭлементы();
		Если ПодСтроки.Количество() > 0 Тогда
			
			Если  СтрокаДерева.Размещение = ТекущийУзел Тогда
				ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
				Элементы.Товары.ТекущаяСтрока = ИдентификаторСтроки;
				Возврат ИдентификаторСтроки;
			КонецЕсли;
			
			Рез = ОбойтиУровеньДерева(ПодСтроки, п_ТекущийУзел);
			Если Рез <> Неопределено Тогда
				Возврат Рез;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецФункции // ()

&НаКлиенте
Процедура ПриПовторномОткрытии()

	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

	ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

	Если ИДСтроки <> Неопределено Тогда
		Элементы.Товары.Развернуть(ИДСтроки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_Номенклатура" Тогда

		Если Параметр.Свойство("Ключ") 
			И ЗначениеЗаполнено(Параметр.Ключ) Тогда
			
			//РеквизитРазмещение = НоменклатураСервер.ПолучитьРеквизитРазмещение(Параметр.Ключ);
			//
			//Если ЗначениеЗаполнено(РеквизитРазмещение) Тогда
			//	ТекущийУзел = РеквизитРазмещение;
			//	ЗаполнитьДеревоТовары();
			//	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	
			//	ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);
			//	Если ИДСтроки <> Неопределено Тогда
			//		Элементы.Товары.Развернуть(ИДСтроки);
			//	КонецЕсли;
			//	НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);
			//КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_ЭлементаРазмещения" Тогда
	
			ТекущийУзел = НоменклатураСервер.ПолучитьУзелКорзины_Элемент();
			
			ЗаполнитьДеревоТовары();

			КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

			ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

			Если ИДСтроки <> Неопределено Тогда
				Элементы.Товары.Развернуть(ИДСтроки);
			КонецЕсли;

			НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);

	ИначеЕсли ИмяСобытия = "Запись_ГруппыРазмещения" Тогда
	
			ТекущийУзел = НоменклатураСервер.ПолучитьУзелКорзины_Группа();
			
			ЗаполнитьДеревоТовары();

			КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

			ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

			Если ИДСтроки <> Неопределено Тогда
				Элементы.Товары.Развернуть(ИДСтроки);
			КонецЕсли;

			НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);

	ИначеЕсли ИмяСобытия = "ПомещениеВКорзину" Тогда
	
		НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)

	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) Тогда
			ПоказатьКартинку(Элемент.ТекущиеДанные.Номенклатура);
		ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.Размещение) Тогда
			Рез = ПоказатьКартинку(Элемент.ТекущиеДанные.Размещение);
			Если Рез = 0 Тогда
				ТекНоменклатура = ПолучитьРеквизитНоменклатура(Элемент.ТекущиеДанные.Размещение);
				ПоказатьКартинку(ТекНоменклатура);
			КонецЕсли;
		КонецЕсли; 	
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Поле = Элементы.ТоварыРазмещение Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			ПоказатьЗначение(Неопределено, ТекущаяСтрока.Номенклатура);
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Размещение) Тогда
			ПоказатьЗначение(Неопределено, ТекущаяСтрока.Размещение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Элементы.Товары.ТекущаяСтрока = Строка;
	
	ЦелевойУзел = "";
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Размещение) Тогда
		ЦелевойУзел = Элемент.ТекущиеДанные.Размещение;
	//ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) Тогда
	//	ЦелевойУзел = НоменклатураСервер.ПолучитьРеквизитРазмещение(Элемент.ТекущиеДанные.Номенклатура);
	Иначе
		Возврат;
	КонецЕсли;

	МассивНоменклатура	= Новый Массив;
	МассивРазмещения	= Новый Массив;
	Для каждого Т Из ПараметрыПеретаскивания.Значение Цикл
		Если ТипЗнч(Т) = Тип("Число") Тогда
			ТекНоменклатура	= Товары.НайтиПоИдентификатору(Т).Номенклатура;
			ТекРазмещение	= Товары.НайтиПоИдентификатору(Т).Размещение;
			Если ЗначениеЗаполнено(ТекНоменклатура) Тогда
				МассивНоменклатура.Добавить(ТекНоменклатура);
			ИначеЕсли ЗначениеЗаполнено(ТекРазмещение) Тогда
				МассивРазмещения.Добавить(ТекРазмещение);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Т) = Тип("СправочникСсылка.Номенклатура") Тогда
			МассивНоменклатура.Добавить(Т);
		КонецЕсли;	
	КонецЦикла;
	
	Если МассивНоменклатура.Количество() > 0 Тогда
		//УстановитьРазмещение(МассивНоменклатура, ЦелевойУзел);
	ИначеЕсли МассивРазмещения.Количество() > 0 Тогда
		УстановитьСтруктуруГрупп(МассивРазмещения, ЦелевойУзел);
	КонецЕсли;

	ТекущийУзел = ЦелевойУзел;
	ЗаполнитьДеревоТовары();

	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

	ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

	Если ИДСтроки <> Неопределено Тогда
		Элементы.Товары.Развернуть(ИДСтроки);
	КонецЕсли;

	Парам = Новый Структура();
	Парам.Вставить("ЦелевойУзел", ЦелевойУзел);
	Если НоменклатураСервер.ЭтоГруппа(ЦелевойУзел) Тогда
		Оповестить("Запись_ГруппыРазмещения", Парам, ЭтотОбъект);
	Иначе
		Оповестить("Запись_ЭлементаРазмещения", Парам, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	ОбновитьИнтерфейс();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		ПометитьНаУдаление(ТекущаяСтрока.Номенклатура);
	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Размещение) Тогда
		ПометитьНаУдаление(ТекущаяСтрока.Размещение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КорзинаЗакрытьНажатие(Элемент)

	НастройкаНачальнойСтраницыНаСервере();
	ОбновитьИнтерфейс();

КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ОбновитьДеревоТоваров(Команда)

	ЗаполнитьДеревоТовары();

	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

	ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

	Если ИДСтроки <> Неопределено Тогда
		Элементы.Товары.Развернуть(ИДСтроки);
	КонецЕсли;
	
	НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);

КонецПроцедуры

&НаКлиенте
Процедура Разместить(Команда)

	ФормаРазмещения = Неопределено;
	ОкнаПриложения = ПолучитьОкна();
	Для каждого ОкноПриложения Из ОкнаПриложения Цикл
		Если ОкноПриложения.Заголовок = "Начальная страница" Тогда
			ФормаРазмещения = ОкноПриложения.Содержимое[1].ЭтаФорма;
		КонецЕсли;
	КонецЦикла;	

	Если ФормаРазмещения = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Рез = ФормаРазмещения.ПолучитьТекущуюСтроку();
	
	ЦелевойУзел = "";
	Если ЗначениеЗаполнено(Рез.Размещение) Тогда
		ЦелевойУзел = Рез.Размещение;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЦелевойУзел) Тогда
		Возврат;
	КонецЕсли;
	
	МассивНоменклатура	= Новый Массив;
	МассивРазмещения	= Новый Массив;
	Для Каждого Т Из Элементы.Товары.ВыделенныеСтроки Цикл
		Если ТипЗнч(Т) = Тип("Число") Тогда
			ТекНоменклатура	= Товары.НайтиПоИдентификатору(Т).Номенклатура;
			ТекРазмещение	= Товары.НайтиПоИдентификатору(Т).Размещение;
			Если ЗначениеЗаполнено(ТекНоменклатура) Тогда
				МассивНоменклатура.Добавить(ТекНоменклатура);
			ИначеЕсли ЗначениеЗаполнено(ТекРазмещение) Тогда
				МассивРазмещения.Добавить(ТекРазмещение);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Т) = Тип("СправочникСсылка.Номенклатура") Тогда
			МассивНоменклатура.Добавить(Т);
		КонецЕсли;	
	КонецЦикла;
	
	Если МассивНоменклатура.Количество() > 0 Тогда
		Рез = НоменклатураПеремещение(МассивНоменклатура, ЦелевойУзел);
	ИначеЕсли МассивРазмещения.Количество() > 0 Тогда
		УстановитьСтруктуруГрупп(МассивРазмещения, ЦелевойУзел);
	КонецЕсли;

	ЗаполнитьДеревоТовары();

	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	
	
	ТекущийУзел = НоменклатураСервер.ПолучитьУзелКорзины_Элемент();
	
	ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

	Если ИДСтроки <> Неопределено Тогда
		Элементы.Товары.Развернуть(ИДСтроки);
	КонецЕсли;
	
	НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);

	Парам = Новый Структура();
	Парам.Вставить("Ключ", ЦелевойУзел);
	Если НоменклатураСервер.ЭтоГруппа(ЦелевойУзел) Тогда
		Оповестить("Запись_ГруппыРазмещения", Парам, ЭтотОбъект);
	Иначе
		Оповестить("Запись_ЭлементаРазмещения", Парам, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область Картинки

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
	
КонецФункции

Функция ПоказатьКартинку(п_ВладелецФайла)

	Запрос = Новый Запрос;

	Если ТипЗнч(п_ВладелецФайла) = Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
			|ГДЕ
			|	НоменклатураПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
			|	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	НоменклатураПрисоединенныеФайлы.ДатаСоздания";
		
	ИначеЕсли ТипЗнч(п_ВладелецФайла) = Тип("СправочникСсылка.Размещения") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РазмещенияПрисоединенныеФайлы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.РазмещенияПрисоединенныеФайлы КАК РазмещенияПрисоединенныеФайлы
			|ГДЕ
			|	РазмещенияПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
			|	И НЕ РазмещенияПрисоединенныеФайлы.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	РазмещенияПрисоединенныеФайлы.ДатаСоздания";
	Иначе
		Возврат 0;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВладелецФайла", п_ВладелецФайла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения1;

		Если Выборка.Следующий() Тогда
			СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		КонецЕсли;

	ИначеЕсли Выборка.Количество() = 2 Тогда
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения2;
		Выборка.Следующий();
		СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку2 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
	ИначеЕсли Выборка.Количество() = 3 Тогда
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения4;
		Выборка.Следующий();
		СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку2 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку3 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
	ИначеЕсли Выборка.Количество() = 4 Тогда
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения4;
		Выборка.Следующий();
		СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку2 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку3 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку4 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
	Иначе		
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения1;
		СсылкаНаКартинку = "";
		СсылкаНаКартинку2 = "";
		СсылкаНаКартинку3 = "";
		СсылкаНаКартинку4 = "";
	КонецЕсли;
	
	Возврат Выборка.Количество();
	
КонецФункции

#КонецОбласти

#Область РаботаСДеревом

Процедура УстановитьСтруктуруГрупп(п_МассивРазмещения, п_ЦелевойУзел)
	
	Для каждого Т Из п_МассивРазмещения Цикл
		Об = Т.ПолучитьОбъект();
		Об.Родитель = п_ЦелевойУзел;
		Попытка
			Об.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьРеквизитНоменклатура(п_Размещение)
	
	Возврат п_Размещение.Номенклатура;

КонецФункции // ()

Процедура ПостроитьДеревоРекурсивно(ВыборкаСИерархией, Дерево)
	
	Пока ВыборкаСИерархией.Следующий() Цикл
		
		Если ВыборкаСИерархией.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда

			Строка = Дерево.Строки.Добавить();
			
			Строка.Размещение				= ВыборкаСИерархией.Размещение;
			Строка.РазмещениеВыделитьЦветом	= ВыборкаСИерархией.РазмещениеВыделитьЦветом;
			Строка.КореньВетки				= Истина;

			ПостроитьДеревоРекурсивно(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Размещение"), Строка);

		ИначеЕсли ВыборкаСИерархией.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			
			Строка1 = Дерево.Строки.Добавить();
			Строка1.Размещение					= ВыборкаСИерархией.Размещение;
			Строка1.РазмещениеВыделитьЦветом	= ВыборкаСИерархией.РазмещениеВыделитьЦветом;
			Строка1.КореньВетки					= Истина;

			Выборка = ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка.Следующий() Цикл
			    Строка2 = Строка1.Строки.Добавить();
			    Строка2.Номенклатура		= Выборка.Номенклатура;
			    Строка2.ВыделитьЦветом		= Выборка.ВыделитьЦветом;
			    Строка2.Количество			= Выборка.Количество;
			КонецЦикла;
			
		КонецЕсли;   

	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДеревоТовары()

	ДеревоРек = РеквизитФормыВЗначение("Товары");
	ДеревоРек.Строки.Очистить();

	Элементы.Товары.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК КореньВетки,
		|	Размещения.Ссылка КАК Размещение,
		|	Размещения.ВыделитьЦветом КАК РазмещениеВыделитьЦветом,
		|	ОстаткиПоРазмещению.Номенклатура КАК Номенклатура,
		|	ОстаткиПоРазмещению.Количество КАК Количество,
		|	NULL КАК ВыделитьЦветом
		|ИЗ
		|	Справочник.Размещения КАК Размещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
		|		ПО Размещения.Ссылка = ОстаткиПоРазмещению.Размещение
		|ГДЕ
		|	НЕ Размещения.ЭтоГруппа
		|	И НЕ Размещения.ПометкаУдаления
		|	И Размещения.Ссылка В ИЕРАРХИИ(&Корзина)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Размещение,
		|	Номенклатура
		|ИТОГИ ПО
		|	Размещение ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	Запрос.УстановитьПараметр("Корзина", НоменклатураСервер.ПолучитьУзелКорзины_Группа());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСИерархией = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Размещение");
	
	ПостроитьДеревоРекурсивно(ВыборкаСИерархией, ДеревоРек);
	
	ЗначениеВРеквизитФормы(ДеревоРек, "Товары");

КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция НоменклатураПеремещение(п_МассивСтрок, п_ЦелевойУзел)

	Для каждого Т Из п_МассивСтрок Цикл

		Если Т.ЭтоГруппа Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если Т.ВариантРазмещения = 3 Тогда
			Возврат Ложь;
		КонецЕсли;

		МассивМест = НоменклатураСервер.ПолучитьРазмещения(Т);
		
		Если МассивМест.Количество() > 1 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если МассивМест.Количество() = 0 Тогда
			НоменклатураСервер.ИзменитьРазмещение(Т, п_ЦелевойУзел,, Т.Количество); // начальное размещение
		Иначе
			НоменклатураСервер.ИзменитьРазмещение(Т, п_ЦелевойУзел, МассивМест[0], Т.Количество); // перемещение
		КонецЕсли;

		НоменклатураСервер.УстановитьВариантРазмещения(Т);
		
	КонецЦикла;

	Возврат Истина;
	
КонецФункции

Процедура ПометитьНаУдаление(п_Размещение)

	Об = п_Размещение.ПолучитьОбъект();
	Об.УстановитьПометкуУдаления(Истина, Истина);

КонецПроцедуры

Процедура НастройкаНачальнойСтраницыНаСервере()

	НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы; 
	СоставФормНачальнойСтраницы = Новый СоставФормНачальнойСтраницы;

	СоставФормНачальнойСтраницы.ЛеваяКолонка.Добавить("Справочник.Номенклатура.ФормаСписка");
	СоставФормНачальнойСтраницы.ПраваяКолонка.Добавить("Справочник.Номенклатура.Форма.ПоРазмещению");
	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФормНачальнойСтраницы);        
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",, НастройкиНачальнойСтраницы);

КонецПроцедуры

#КонецОбласти
